---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyInt64
source: html/974a32c5-455e-de16-b821-6822be62301c.htm
---
# AssetPropertyInt64 Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.